qmk/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/hal_lld.h
/*
    ChibiOS - Copyright (C) 2006-2026 Giovanni Di Sirio.

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    STM32U3xx_TEST/hal_lld.h
 * @brief   STM32U3xx TEST HAL subsystem low level driver header.
 * @pre     This module requires the following macros to be defined in the
 *          @p board.h file:
 *          - STM32_LSECLK.
 *          - STM32_LSEDRV.
 *          - STM32_LSE_BYPASS (optionally).
 *          - STM32_HSECLK.
 *          - STM32_HSE_BYPASS (optionally).
 *          - STM32_HSE_DIGITAL (optionally).
 *          .
 *          One of the following macros must also be defined:
 *          - STM32U375xx, STM32U385xx.
 *          .
 *
 * @addtogroup HAL
 * @{
 */

#ifndef HAL_LLD_H
#define HAL_LLD_H

#include "stm32_registry.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @brief   Requires use of SPIv2 driver model.
 */
#define HAL_LLD_SELECT_SPI_V2               TRUE

/**
 * @name    Platform identification
 * @{
 */
#if defined(STM32U375xx) || defined(__DOXYGEN__)
  #define PLATFORM_NAME                     "STM32U3 Low-power"

#elif defined(STM32U385xx)
  #define PLATFORM_NAME                     "STM32U3 Low-power with Crypto"

#else
  #error "STM32U3 device not specified"
#endif

/**
 * @brief   Sub-family identifier.
 */
#if !defined(STM32U3XX) || defined(__DOXYGEN__)
  #define STM32U3XX
#endif
/** @} */

/**
 * @name    MSIRC0 96MHz oscillator settings
 * @{
 */
/* Note, combines settings in RCC_CR and RCC_ICSCR.*/
#define RCC_MSIRC0_FREE                     0
#define RCC_MSIRC0_PLL_LSE                  1
#define RCC_MSIRC0_PLL_HSE                  2
#define RCC_MSIRC0_PLL_LSE_FAST             3
#define RCC_MSIRC0_PLL_HSE_FAST             4
/** @} */

/**
 * @name    MSIRC1 24MHz oscillator settings
 * @{
 */
/* Note, combines settings in RCC_CR and RCC_ICSCR.*/
#define RCC_MSIRC1_FREE                     0
#define RCC_MSIRC1_PLL_LSE                  1
#define RCC_MSIRC1_PLL_HSE                  2
#define RCC_MSIRC1_PLL_LSE_FAST             3
#define RCC_MSIRC1_PLL_HSE_FAST             4
/** @} */

/**
 * @name    Source and divider for MSIS
 * @{
 */
#define RCC_ICSCR1_MSIS_IRC0_DIV1           0       /* 96MHz */
#define RCC_ICSCR1_MSIS_IRC0_DIV2           1       /* 48MHz */
#define RCC_ICSCR1_MSIS_IRC0_DIV4           2       /* 24MHz */
#define RCC_ICSCR1_MSIS_IRC0_DIV8           3       /* 12MHz */
#define RCC_ICSCR1_MSIS_IRC1_DIV1           4       /* ~24MHz */
#define RCC_ICSCR1_MSIS_IRC1_DIV2           5       /* ~12MHz */
#define RCC_ICSCR1_MSIS_IRC1_DIV4           6       /* ~6MHz */
#define RCC_ICSCR1_MSIS_IRC1_DIV8           7       /* ~3MHz */
/** @} */

/**
 * @name    Source and divider for MSIK
 * @{
 */
#define RCC_ICSCR1_MSIK_IRC0_DIV1           0       /* 96MHz */
#define RCC_ICSCR1_MSIK_IRC0_DIV2           1       /* 48MHz */
#define RCC_ICSCR1_MSIK_IRC0_DIV4           2       /* 24MHz */
#define RCC_ICSCR1_MSIK_IRC0_DIV8           3       /* 12MHz */
#define RCC_ICSCR1_MSIK_IRC1_DIV1           4       /* ~24MHz */
#define RCC_ICSCR1_MSIK_IRC1_DIV2           5       /* ~12MHz */
#define RCC_ICSCR1_MSIK_IRC1_DIV4           6       /* ~6MHz */
#define RCC_ICSCR1_MSIK_IRC1_DIV8           7       /* ~3MHz */
/** @} */

/**
 * @name    PWR_VOSR register helpers
 * @{
 */
#define PWR_VOSR_RANGE_Msk                  (PWR_VOSR_R1EN_Msk | PWR_VOSR_R2EN_Msk)
#define PWR_VOSR_RANGE1                     PWR_VOSR_R1EN
#define PWR_VOSR_RANGE2                     PWR_VOSR_R2EN
/** @} */


/**
 * @name    FLASH_ACR register helpers
 * @{
 */
#define FLASH_ACR_LATENCY_FIELD(n)          ((n) << FLASH_ACR_LATENCY_Pos)
#define FLASH_ACR_LATENCY_0WS               FLASH_ACR_LATENCY_FIELD(0U)
#define FLASH_ACR_LATENCY_1WS               FLASH_ACR_LATENCY_FIELD(1U)
#define FLASH_ACR_LATENCY_2WS               FLASH_ACR_LATENCY_FIELD(2U)
#define FLASH_ACR_LATENCY_3WS               FLASH_ACR_LATENCY_FIELD(3U)
#define FLASH_ACR_LATENCY_4WS               FLASH_ACR_LATENCY_FIELD(4U)
/** @} */

/**
 * @name    RCC_ICSCR1 register helpers
 * @{
 */
#define RCC_ICSCR1_MSIHSINDIV_FIELD(n)      ((n) << RCC_ICSCR1_MSIHSINDIV_Pos)
#define RCC_ICSCR1_MSIHSINDIV_HSE16         RCC_ICSCR1_MSIHSINDIV_FIELD(0U)
#define RCC_ICSCR1_MSIHSINDIV_HSE32         RCC_ICSCR1_MSIHSINDIV_FIELD(1U)

#define RCC_ICSCR1_MSIPLL1SEL_FIELD(n)      ((n) << RCC_ICSCR1_MSIPLL1SEL_Pos)
#define RCC_ICSCR1_MSIPLL1SEL_LSE           RCC_ICSCR1_MSIPLL1SEL_FIELD(0U)
#define RCC_ICSCR1_MSIPLL1SEL_HSE           RCC_ICSCR1_MSIPLL1SEL_FIELD(1U)

#define RCC_ICSCR1_MSIPLL0SEL_FIELD(n)      ((n) << RCC_ICSCR1_MSIPLL0SEL_Pos)
#define RCC_ICSCR1_MSIPLL0SEL_LSE           RCC_ICSCR1_MSIPLL0SEL_FIELD(0U)
#define RCC_ICSCR1_MSIPLL0SEL_HSE           RCC_ICSCR1_MSIPLL0SEL_FIELD(1U)

#define RCC_ICSCR1_MSIBIAS_FIELD(n)         ((n) << RCC_ICSCR1_MSIBIAS_Pos)
#define RCC_ICSCR1_MSIBIAS_CONTINUOUS       RCC_ICSCR1_MSIBIAS_FIELD(0U)
#define RCC_ICSCR1_MSIBIAS_SAMPLING         RCC_ICSCR1_MSIBIAS_FIELD(1U)

#define RCC_ICSCR1_MSIRGSEL_FIELD(n)        ((n) << RCC_ICSCR1_MSIRGSEL_Pos)
#define RCC_ICSCR1_MSIRGSEL_CSR             RCC_ICSCR1_MSIRGSEL_FIELD(0U)
#define RCC_ICSCR1_MSIRGSEL_ICSCR1          RCC_ICSCR1_MSIRGSEL_FIELD(1U)

#define RCC_ICSCR1_MSIPLL1N_FIELD(n)        ((n) << RCC_ICSCR1_MSIPLL1N_Pos)

#define RCC_ICSCR1_MSIKDIV_FIELD(n)         ((n) << RCC_ICSCR1_MSIKDIV_Pos)

#define RCC_ICSCR1_MSIKSEL_FIELD(n)         ((n) << RCC_ICSCR1_MSIKSEL_Pos)
#define RCC_ICSCR1_MSIKSEL_MSIRC0           RCC_ICSCR1_MSIKSEL_FIELD(0U)
#define RCC_ICSCR1_MSIKSEL_MSIRC1           RCC_ICSCR1_MSIKSEL_FIELD(1U)

#define RCC_ICSCR1_MSISDIV_FIELD(n)         ((n) << RCC_ICSCR1_MSISDIV_Pos)

#define RCC_ICSCR1_MSISSEL_FIELD(n)         ((n) << RCC_ICSCR1_MSISSEL_Pos)
#define RCC_ICSCR1_MSISSEL_MSIRC0           RCC_ICSCR1_MSISSEL_FIELD(0U)
#define RCC_ICSCR1_MSISSEL_MSIRC1           RCC_ICSCR1_MSISSEL_FIELD(1U)
/** @} */

/**
 * @name    RCC_CFGR1 register helpers
 * @{
 */
#define RCC_CFGR1_SWS_FIELD(n)              ((n) << RCC_CFGR1_SWS_Pos)
#define RCC_CFGR1_SWS_MSIS                  RCC_CFGR1_SWS_FIELD(0U)
#define RCC_CFGR1_SWS_HSI16                 RCC_CFGR1_SWS_FIELD(1U)
#define RCC_CFGR1_SWS_HSE                   RCC_CFGR1_SWS_FIELD(2U)

#define RCC_CFGR1_STOPWUCK_FIELD(n)         ((n) << RCC_CFGR1_STOPWUCK_Pos)
#define RCC_CFGR1_STOPWUCK_MSIS             RCC_CFGR1_STOPWUCK_FIELD(0U)
#define RCC_CFGR1_STOPWUCK_HSI16            RCC_CFGR1_STOPWUCK_FIELD(1U)

