qmk/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/hal_lld.h
#define RCC_CFGR1_STOPKERWUCK_FIELD(n)      ((n) << RCC_CFGR1_STOPKERWUCK_Pos)
#define RCC_CFGR1_STOPKERWUCK_MSIK          RCC_CFGR1_STOPKERWUCK_FIELD(0U)
#define RCC_CFGR1_STOPKERWUCK_HSI16         RCC_CFGR1_STOPKERWUCK_FIELD(1U)

/** @} */

/**
 * @name    RCC_CFGR2 register helpers
 * @{
 */
#define STM32_HPRE_MASK                     RCC_CFGR2_HPRE_Msk
#define STM32_HPRE_POS                      RCC_CFGR2_HPRE_Pos

#define STM32_PPRE1_MASK                    RCC_CFGR2_PPRE1_Msk
#define STM32_PPRE1_POS                     RCC_CFGR2_PPRE1_Pos

#define STM32_PPRE2_MASK                    RCC_CFGR2_PPRE2_Msk
#define STM32_PPRE2_POS                     RCC_CFGR2_PPRE2_Pos
/** @} */

/**
 * @name    RCC_CFGR3 register helpers
 * @{
 */
#define STM32_PPRE3_MASK                    RCC_CFGR3_PPRE3_Msk
#define STM32_PPRE3_POS                     RCC_CFGR3_PPRE3_Pos
/** @} */

/**
 * @name    RCC_CFGR4 register helpers
 * @{
 */
#define RCC_CFGR4_BOOSTSEL_FIELD(n)         ((n) << RCC_CFGR4_BOOSTSEL_Pos)
#define RCC_CFGR4_BOOSTSEL_NOCLOCK          RCC_CFGR4_BOOSTSEL_FIELD(0U)
#define RCC_CFGR4_BOOSTSEL_MSIS             RCC_CFGR4_BOOSTSEL_FIELD(1U)
#define RCC_CFGR4_BOOSTSEL_HSI16            RCC_CFGR4_BOOSTSEL_FIELD(2U)
#define RCC_CFGR4_BOOSTSEL_HSE              RCC_CFGR4_BOOSTSEL_FIELD(3U)

#define RCC_CFGR4_BOOSTDIV_FIELD(n)         ((n) << RCC_CFGR4_BOOSTDIV_Pos)
#define RCC_CFGR4_BOOSTDIV_DIV1             RCC_CFGR4_BOOSTDIV_FIELD(0U)
#define RCC_CFGR4_BOOSTDIV_DIV2             RCC_CFGR4_BOOSTDIV_FIELD(1U)
#define RCC_CFGR4_BOOSTDIV_DIV4             RCC_CFGR4_BOOSTDIV_FIELD(2U)
#define RCC_CFGR4_BOOSTDIV_DIV6             RCC_CFGR4_BOOSTDIV_FIELD(3U)
#define RCC_CFGR4_BOOSTDIV_DIV8             RCC_CFGR4_BOOSTDIV_FIELD(4U)
#define RCC_CFGR4_BOOSTDIV_DIV10            RCC_CFGR4_BOOSTDIV_FIELD(5U)
#define RCC_CFGR4_BOOSTDIV_DIV12            RCC_CFGR4_BOOSTDIV_FIELD(6U)
#define RCC_CFGR4_BOOSTDIV_DIV14            RCC_CFGR4_BOOSTDIV_FIELD(7U)
#define RCC_CFGR4_BOOSTDIV_DIV16            RCC_CFGR4_BOOSTDIV_FIELD(8U)
/** @} */

/**
 * @name    RCC_CCIPR1 register helpers
 * @{
 */
#define RCC_CCIPR1_TIMICSEL_FIELD(n)        ((n) << RCC_CCIPR1_TIMICSEL_Pos)
#define RCC_CCIPR1_TIMICSEL_NOCLOCK         RCC_CCIPR1_TIMICSEL_FIELD(0U)
#define RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIS4   RCC_CCIPR1_TIMICSEL_FIELD(4U)
#define RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIK4   RCC_CCIPR1_TIMICSEL_FIELD(5U)
#define RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIS4   RCC_CCIPR1_TIMICSEL_FIELD(6U)
#define RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIK4   RCC_CCIPR1_TIMICSEL_FIELD(7U)
/** @} */

/**
 * @name    RCC_BDCR register helpers
 * @{
 */
/** @} */

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @name    Configuration options
 * @{
 */
/**
 * @brief   Disables the PWR/RCC initialization in the HAL.
 */
#if !defined(STM32_NO_INIT) || defined(__DOXYGEN__)
#define STM32_NO_INIT                       FALSE
#endif

/**
 * @brief   External audio clock frequency.
 */
#if !defined(STM32_AUDIOCLK) || defined(__DOXYGEN__)
#define STM32_AUDIOCLK                      0U
#endif

/**
 * @brief   PWR CR3 register initialization value.
 */
#if !defined(STM32_PWR_CR3) || defined(__DOXYGEN__)
#define STM32_PWR_CR3                       (PWR_CR3_FSTEN | PWR_CR3_REGSEL)
#endif

/**
 * @brief   PWR CR3 register initialization value.
 */
#if !defined(STM32_PWR_SVMCR) || defined(__DOXYGEN__)
#define STM32_PWR_SVMCR                     (PWR_SVMCR_ASV | PWR_SVMCR_USV | PWR_SVMCR_AVM1EN | PWR_SVMCR_AVM2EN | PWR_SVMCR_UVMEN)
#endif

/**
 * @brief   PWR WUCR1 register initialization value.
 */
#if !defined(STM32_PWR_WUCR1) || defined(__DOXYGEN__)
#define STM32_PWR_WUCR1                     (0U)
#endif

/**
 * @brief   PWR WUCR2 register initialization value.
 */
#if !defined(STM32_PWR_WUCR2) || defined(__DOXYGEN__)
#define STM32_PWR_WUCR2                     (0U)
#endif

/**
 * @brief   PWR WUCR3 register initialization value.
 */
#if !defined(STM32_PWR_WUCR3) || defined(__DOXYGEN__)
#define STM32_PWR_WUCR3                     (0U)
#endif

/**
 * @brief   PWR BDCR register initialization value.
 */
#if !defined(STM32_PWR_BDCR) || defined(__DOXYGEN__)
#define STM32_PWR_BDCR                      (0U)
#endif

/**
 * @brief   PWR SECCFGR register initialization value.
 */
#if !defined(STM32_PWR_SECCFGR) || defined(__DOXYGEN__)
#define STM32_PWR_SECCFGR                   (0U)
#endif

/**
 * @brief   PWR PRIVCFGR register initialization value.
 */
#if !defined(STM32_PWR_PRIVCFGR) || defined(__DOXYGEN__)
#define STM32_PWR_PRIVCFGR                  (0U)
#endif

/**
 * @brief   PWR APCR register initialization value.
 */
#if !defined(STM32_PWR_APCR) || defined(__DOXYGEN__)
#define STM32_PWR_APCR                      (0U)
#endif

/**
 * @brief   PWR PUCRA register initialization value.
 */
#if !defined(STM32_PWR_PUCRA) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRA                     (0U)
#endif

/**
 * @brief   PWR PDCRA register initialization value.
 */
#if !defined(STM32_PWR_PDCRA) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRA                     (0U)
#endif

/**
 * @brief   PWR PUCRB register initialization value.
 */
#if !defined(STM32_PWR_PUCRB) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRB                     (0U)
#endif

/**
 * @brief   PWR PDCRB register initialization value.
 */
#if !defined(STM32_PWR_PDCRB) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRB                     (0U)
#endif

/**
 * @brief   PWR PUCRC register initialization value.
 */
#if !defined(STM32_PWR_PUCRC) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRC                     (0U)
#endif

/**
 * @brief   PWR PDCRC register initialization value.
 */
#if !defined(STM32_PWR_PDCRC) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRC                     (0U)
#endif

/**
 * @brief   PWR PUCRD register initialization value.
 */
#if !defined(STM32_PWR_PUCRD) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRD                     (0U)
#endif

/**
 * @brief   PWR PDCRD register initialization value.
 */
#if !defined(STM32_PWR_PDCRD) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRD                     (0U)
#endif

/**
 * @brief   PWR PUCRE register initialization value.
 */
#if !defined(STM32_PWR_PUCRE) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRE                     (0U)
#endif

/**
 * @brief   PWR PDCRE register initialization value.
 */
#if !defined(STM32_PWR_PDCRE) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRE                     (0U)
#endif

/**
 * @brief   PWR PUCRG register initialization value.
 */
#if !defined(STM32_PWR_PUCRG) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRG                     (0U)
#endif

/**
 * @brief   PWR PDCRG register initialization value.
 */
#if !defined(STM32_PWR_PDCRG) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRG                     (0U)
#endif

/**
 * @brief   PWR PUCRH register initialization value.
 */
#if !defined(STM32_PWR_PUCRH) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRH                     (0U)
#endif

/**
 * @brief   PWR PDCRH register initialization value.
 */
#if !defined(STM32_PWR_PDCRH) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRH                     (0U)
#endif

/**
 * @brief   PWR I3CPUCR1 register initialization value.
 */
#if !defined(STM32_PWR_I3CPUCR1) || defined(__DOXYGEN__)
#define STM32_PWR_I3CPUCR1                  (0U)
#endif

/**
 * @brief   PWR I3CPUCR2 register initialization value.
 */
#if !defined(STM32_PWR_I3CPUCR2) || defined(__DOXYGEN__)
#define STM32_PWR_I3CPUCR2                  (0U)
#endif

/**
 * @brief   FLASH ACR register initialization value.
 * @note    Do not specify the LATENCY bits because those are calculated
 *          depending on other settings and ORed to this value.
 */
#if !defined(STM32_FLASH_ACR) || defined(__DOXYGEN__)
#define STM32_FLASH_ACR                     (FLASH_ACR_PRFTEN)
#endif

/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

