qmk/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/hal_lld.h
/*
 * Configuration-related checks.
 */
#if !defined(STM32U3xx_TEST_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32U3xx_TEST_MCUCONF not defined"
#endif

#if defined(STM32U375xx) && !defined(STM32U375_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32U375_MCUCONF not defined"

#elif defined(STM32U385xx) && !defined(STM32U385_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32U385_MCUCONF not defined"

#endif

#include "clocktree.h"

/**
 * @name    Activation times in microseconds
 * @{
 */
#define STM32_RELAXED_TIMEOUT_FACTOR        5U
#define STM32_REGULATORS_TRANSITION_TIME    (21U * STM32_RELAXED_TIMEOUT_FACTOR)
#define STM32_OSCILLATORS_STARTUP_TIME      (2000U * STM32_RELAXED_TIMEOUT_FACTOR)
#define STM32_MSIPLL_STARTUP_TIME           (800U * STM32_RELAXED_TIMEOUT_FACTOR)
#define STM32_SYSCLK_SWITCH_TIME            (50U * STM32_RELAXED_TIMEOUT_FACTOR)
/** @} */

/* Compatibility aliases for helpers still expecting bypass-specific names. */
#define STM32_HSECLK_BYP_MIN                STM32_HSECLK_MIN
#define STM32_HSECLK_BYP_MAX                STM32_HSECLK_MAX
#define STM32_LSECLK_BYP_MIN                STM32_LSECLK_MIN
#define STM32_LSECLK_BYP_MAX                STM32_LSECLK_MAX

#if (STM32_CFG_PWR_VOSR == PWR_VOSR_RANGE1) || defined(__DOXYGEN__)
#define STM32_BOOSTEN_THRESHOLD             0U
#elif (STM32_CFG_PWR_VOSR == PWR_VOSR_RANGE2)
#define STM32_BOOSTEN_THRESHOLD             24000000U
#else
#error "invalid STM32_CFG_PWR_VOSR value specified"
#endif

/* EPOD boost-related settings. */
#if STM32_SYSCLK_FREQ > STM32_BOOSTEN_THRESHOLD
  #define STM32_BOOSTER_ENABLED             TRUE
  #if STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_MSIS
    #define STM32_BOOSTSEL                  RCC_CFGR4_BOOSTSEL_MSIS
    #define STM32_BOOSTDIV                  0U
  #elif STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_HSI16
    #define STM32_BOOSTSEL                  RCC_CFGR4_BOOSTSEL_HSI16
    #define STM32_BOOSTDIV                  RCC_CFGR4_BOOSTDIV_DIV2
  #elif STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_HSE
    #define STM32_BOOSTSEL                  RCC_CFGR4_BOOSTSEL_HSE
    #if STM32_HSE_FREQ <= 12000000U
      #define STM32_BOOSTDIV                RCC_CFGR4_BOOSTDIV_DIV1
    #elif STM32_HSE_FREQ <= 24000000U
      #define STM32_BOOSTDIV                RCC_CFGR4_BOOSTDIV_DIV2
    #else
      #define STM32_BOOSTDIV                RCC_CFGR4_BOOSTDIV_DIV4
    #endif
  #else
    #error "invalid STM32_CFG_SYSCLK_SEL value specified"
  #endif
#else
  #define STM32_BOOSTER_ENABLED             FALSE
  #define STM32_BOOSTSEL                    0U
  #define STM32_BOOSTDIV                    0U
#endif

/**
 * @brief   Flash wait-state settings.
 */
#if (STM32_HCLK_FREQ <= STM32_FLASH_0WS_MAX) || defined(__DOXYGEN__)
#define STM32_FLASHBITS                     FLASH_ACR_LATENCY_0WS
#elif (STM32_HCLK_FREQ <= STM32_FLASH_1WS_MAX)
#define STM32_FLASHBITS                     FLASH_ACR_LATENCY_1WS
#elif (STM32_HCLK_FREQ <= STM32_FLASH_2WS_MAX)
#define STM32_FLASHBITS                     FLASH_ACR_LATENCY_2WS
#elif (STM32_HCLK_FREQ <= STM32_FLASH_3WS_MAX)
#define STM32_FLASHBITS                     FLASH_ACR_LATENCY_3WS
#elif (STM32_HCLK_FREQ <= STM32_FLASH_4WS_MAX)
#define STM32_FLASHBITS                     FLASH_ACR_LATENCY_4WS
#else
#define STM32_FLASHBITS                     FLASH_ACR_LATENCY_5WS
#endif

#if STM32_CFG_CLOCK_DYNAMIC == TRUE
#define HAL_LLD_USE_CLOCK_MANAGEMENT
#endif

/* ICache handler. */
#include "stm32_icache.inc"

/* Clock handlers. */
#include "stm32_lsi.inc"
#include "stm32_hsi48.inc"
#include "stm32_hsi16.inc"
#include "stm32_lse.inc"
#include "stm32_hse.inc"

/*===========================================================================*/
/* Compatibility clock aliases.                                              */
/*===========================================================================*/

#define STM32_SYSCLK                        STM32_SYSCLK_CLOCK
#define STM32_HCLK                          STM32_HCLK_CLOCK
#define STM32_PCLK1                         STM32_PCLK1_CLOCK
#define STM32_PCLK2                         STM32_PCLK2_CLOCK
#define STM32_PCLK3                         STM32_PCLK3_CLOCK
#define STM32_RTCCLK                        STM32_RTC_CLOCK
#define STM32_RTCSEL                        STM32_RTC_BITS
#define STM32_LSCOSEL                       STM32_LSCO_BITS

#define STM32_USART1CLK                     STM32_USART1_CLOCK
#define STM32_USART3CLK                     STM32_USART3_CLOCK
#define STM32_UART4CLK                      STM32_UART4_CLOCK
#define STM32_UART5CLK                      STM32_UART5_CLOCK
#define STM32_LPUART1CLK                    STM32_LPUART1_CLOCK

#define STM32_TIM16CCLK                     STM32_TIM16IC_CLOCK
#define STM32_TIM17CCLK                     STM32_TIM17IC_CLOCK
#define STM32_LPTIM2CCLK                    STM32_LPTIM2IC_CLOCK
#define STM32_LPTIM1CLK                     STM32_LPTIM1_CLOCK
#define STM32_LPTIM2CLK                     STM32_LPTIM2_CLOCK
#define STM32_LPTIM3CLK                     STM32_LPTIM34_CLOCK
#define STM32_LPTIM4CLK                     STM32_LPTIM34_CLOCK
#define STM32_SPI1CLK                       STM32_SPI1_CLOCK
#define STM32_SPI2CLK                       STM32_SPI2_CLOCK
#define STM32_SPI3CLK                       STM32_SPI3_CLOCK
#define STM32_OSPICLK                       STM32_OCTOSPI_CLOCK
#define STM32_SYSTICKCLK                    STM32_SYSTICK_CLOCK
#define STM32_ICLK                          STM32_ICLK_CLOCK
#define STM32_USBCLK                        STM32_USB_CLOCK
#define STM32_SDMMC1CLK                     STM32_SDMMC1_CLOCK
#define STM32_I2C1CLK                       STM32_I2C1_CLOCK
#define STM32_I2C2CLK                       STM32_I2C2_CLOCK
#define STM32_I2C3CLK                       STM32_I2C3_CLOCK
#define STM32_I3C1CLK                       STM32_I3C1_CLOCK
#define STM32_I3C2CLK                       STM32_I3C2_CLOCK
#define STM32_ADCDACCLK                     STM32_ADCDAC_CLOCK
#define STM32_DAC1SHSELCLK                  STM32_DAC1SH_CLOCK
#define STM32_RNGCLK                        STM32_RNG_CLOCK
#define STM32_FDCAN1CLK                     STM32_FDCAN1_CLOCK
#define STM32_SAI1CLK                       STM32_SAI1_CLOCK
#define STM32_ADF1CLK                       STM32_ADF1_CLOCK

#define STM32_TIMP1CLK                      STM32_PCLK1TIM_CLOCK
#define STM32_TIMP2CLK                      STM32_PCLK2TIM_CLOCK
#define STM32_TIMCLK1                       STM32_PCLK1TIM_CLOCK
#define STM32_TIMCLK2                       STM32_PCLK2TIM_CLOCK
#define STM32_ADC1_CLOCK                    STM32_ADCDAC_CLOCK
#define STM32_ADC2_CLOCK                    STM32_ADCDAC_CLOCK
#define STM32_DAC1_CLOCK                    STM32_ADCDAC_CLOCK

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/**
 * @brief   Type of a clock configuration structure.
 */
typedef struct {
  uint32_t          pwr_vosr;
  uint32_t          rcc_cr;
  uint32_t          rcc_icscr1;
  uint32_t          rcc_cfgr1;
  uint32_t          rcc_cfgr2;
  uint32_t          rcc_cfgr3;
  uint32_t          rcc_cfgr4;
  uint32_t          flash_acr;
} halclkcfg_t;

/**
 * @brief   Type of a timeout counter.
 */
typedef uint32_t halcnt_t;

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/**
 * @brief   Real time counter frequency exported to the safety module.
 * @note    The counter is the internal DWS cycles counter so in runs at
 *          the same frequency of CPU.
 */
#define HAL_LLD_GET_CNT_FREQUENCY()         hal_lld_get_clock_point(CLK_HCLK)

/**
 * @brief   Real time counter value exported to the safety module.
 */
#define HAL_LLD_GET_CNT_VALUE()             (DWT->CYCCNT)

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

/* Various helpers.*/
#include "nvic.h"
#include "cache.h"
//#include "mpu_v8m.h"
#include "stm32_isr.h"
#include "stm32_dma3.h"
#include "stm32_exti.h"
#include "stm32_rcc.h"
#include "stm32_tim.h"

#if defined(HAL_LLD_USE_CLOCK_MANAGEMENT) && !defined(__DOXYGEN__)
extern const halclkcfg_t hal_clkcfg_reset;
extern const halclkcfg_t hal_clkcfg_default;
#endif

#ifdef __cplusplus
extern "C" {
#endif
  void hal_lld_init(void);
  void stm32_clock_init(void);
#if defined(HAL_LLD_USE_CLOCK_MANAGEMENT) || defined(__DOXYGEN__)
  bool hal_lld_clock_switch_mode(const halclkcfg_t *ccp);
  halfreq_t hal_lld_get_clock_point(halclkpt_t clkpt);
#endif /* defined(HAL_LLD_USE_CLOCK_MANAGEMENT) */
#ifdef __cplusplus
}
#endif

#endif /* HAL_LLD_H */

/** @} */
